spec/cassettes/Subscription/_debito/_payment_request/should_return_success_if_the_payment_request_is_valid.yml

---
http_interactions:
- request:
    method: post
    uri: https://4WV0YFD94HGZS9QSL8NU1LIPUYQELTGO:YUSNOJ3UWDS3CMDYCV8OKIX2MF7MOM6AUGMZVZ6X@desenvolvedor.moip.com.br/sandbox/ws/alpha/EnviarInstrucao/Unica
    body:
      encoding: UTF-8
      string: "<EnviarInstrucao><InstrucaoUnica TipoValidacao=\"Transparente\"><Razao>Doação
        para o MeuRio - http://meurio.org.br - debit</Razao><Valores><Valor moeda=\"BRL\">90.00</Valor></Valores><IdProprio>1395183666</IdProprio><Pagador><Nome>Juquinha
        Da Silva</Nome><Email>6email6@gmail.com</Email><IdPagador>1</IdPagador><EnderecoCobranca><Logradouro>Rua
        Belisario Tavora 500</Logradouro><Numero>100</Numero><Complemento>Laranjeiras</Complemento><Bairro>Laranjeiras</Bairro><Cidade>Rio
        de Janeiro</Cidade><Estado>RJ</Estado><Pais>BRA</Pais><CEP>78132-500</CEP><TelefoneFixo>(21)99713-7471</TelefoneFixo></EnderecoCobranca></Pagador></InstrucaoUnica></EnviarInstrucao>"
    headers: {}
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Tue, 18 Mar 2014 23:01:06 GMT
      Server:
      - Apache
      Content-Length:
      - '273'
      Vary:
      - Accept-Encoding
      Content-Type:
      - text/xml;charset=UTF-8
    body:
      encoding: UTF-8
      string: "<ns1:EnviarInstrucaoUnicaResponse xmlns:ns1=\"http://www.moip.com.br/ws/alpha/\"><Resposta><ID>201403182001071290000004534100</ID><Status>Sucesso</Status><Token>M2W0Z1V4E0Z3M1S8X2L0N0K1D0O7B1A2H980S0F0G070U0Z435E394M1J0A0</Token></Resposta></ns1:EnviarInstrucaoUnicaResponse>"
    http_version: 
  recorded_at: Tue, 18 Mar 2014 23:01:07 GMT
- request:
    method: get
    uri: https://4WV0YFD94HGZS9QSL8NU1LIPUYQELTGO:YUSNOJ3UWDS3CMDYCV8OKIX2MF7MOM6AUGMZVZ6X@desenvolvedor.moip.com.br/sandbox/rest/pagamento?callback=?&pagamentoWidget=%7B%22pagamentoWidget%22:%7B%22referer%22:null,%22token%22:%22M2W0Z1V4E0Z3M1S8X2L0N0K1D0O7B1A2H980S0F0G070U0Z435E394M1J0A0%22,%22dadosPagamento%22:%7B%22Forma%22:%22DebitoBancario%22,%22Instituicao%22:%22Itau%22%7D%7D%7D
    body:
      encoding: US-ASCII
      string: ''
    headers: {}
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Tue, 18 Mar 2014 23:01:08 GMT
      Server:
      - Apache
      Content-Length:
      - '92'
      Vary:
      - Accept-Encoding
      Content-Type:
      - application/json
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        Pyh7IkNvZGlnbyI6MCwiU3RhdHVzUGFnYW1lbnRvIjoiU3VjZXNzbyIsIk1l
        bnNhZ2VtIjoiUmVxdWlzacOnw6NvIHByb2Nlc3NhZGEgY29tIHN1Y2Vzc28i
        fSk=
    http_version: 
  recorded_at: Tue, 18 Mar 2014 23:01:10 GMT
recorded_with: VCR 2.8.0
